package sem3.task3;

import java.io.FileNotFoundException;

//  Задание №3
//1. Создайте класс исключения, который будет выбрасываться при делении на 0.
// Исключение должно отображать для пользователя сообщение об ошибке.
//2. Создайте класс исключений, которое возникать при обращении к пустому элементу
// в массиве ссылочного типа. Исключение должно отображать понятное
//  для пользователя сообщение об ошибке.
//3. Создайте класс исключения, которое будет возникать при попытке открыть
// несуществующий файл... Исключение должно отображать понятное для пользователя сообщение об ошибке.
public class Main extends Exception {
    public static void main(String[] args) {

    }
}
